DataProcessors/ПечатьКвитанций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ПечатьКвитанций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапаковатьZIP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматPDF</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматODS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматXLS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматMXL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовСМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСотовогоТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Печать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РегистрУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РегистрУведомлений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаорСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУведомления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПечатьКвитанций/Forms/ФормаПроверкиСтатусовСМС/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru='Поле ""Организация"" не заполнено';uk='Полі ""Організація"" не заповнено'");
		Сообщение.Поле = "Объект.Организация";
		Сообщение.Сообщить();
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Поле ""Здание"" не заполнено';uk='Полі ""Будівля"" не заповнена'");
		Сообщение.Поле = "Объект.Здание";
		Сообщение.Сообщить();
	Иначе
		Таблица.Очистить();
		ЗаполнитьНаСервере();
	КонецЕсли;
	
 КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьНаСервере()
	 
	Запрос  = Новый Запрос;
	Запрос.Текст  =  "ВЫБРАТЬ
	                 |	РегистрУведомлений.МесяцНачисления,
	                 |	РегистрУведомлений.ЛицевойСчет КАК ЛицевойСчет,
	                 |	РегистрУведомлений.Период,
	                 |	РегистрУведомлений.Операция,
	                 |	РегистрУведомлений.СтатусСМС,
	                 |	РегистрУведомлений.ИдентификаторСообщения,
	                 |	РегистрУведомлений.ЛицевойСчет.МобТелефон КАК МобТелефон
	                 |ИЗ
	                 |	РегистрСведений.РегистрУведомлений КАК РегистрУведомлений
	                 |ГДЕ
	                 |	РегистрУведомлений.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                 |	И РегистрУведомлений.ЛицевойСчет.Владелец = &Здание
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ЛицевойСчет" ;
	 Запрос.УстановитьПараметр("НачалоПериода",Период.ДатаНачала);
	 Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	 Запрос.УстановитьПараметр("Здание",Объект.Здание);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Таблица.Добавить();
		 НоваяСтрока.Период = Выборка.Период;
		 НоваяСтрока.ЛицевойСчет  = Выборка.ЛицевойСчет;
		 НоваяСтрока.НомерСотовогоТелефона =  Выборка.МобТелефон;
		 НоваяСтрока.МесяцНачисления  = Выборка.МесяцНачисления;
		 НоваяСтрока.СтатусСМС = Выборка.СтатусСМС;
		 НоваяСтрока.ИдентификаторСообщения = Выборка.ИдентификаторСообщения;
	 КонецЦикла;
 	
 
 КонецПроцедуры // ()
 

&НаКлиенте
Процедура ОбновитьСтатусыСМС(Команда)
	
	Если Таблица.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не заполнен список сообщений.';uk='Чи не заповнений список повідомлень.'");
		Сообщение.Поле = "Таблица";
		Сообщение.Сообщить(); 
	КонецЕсли;	
	ОбновитьСтатусыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыНаСервере()

	Логин = Константы.ЛогинДляОтправкиSMS.Получить();
	Пароль = Константы.ПарольДляОтправкиSMS.Получить();

	
	Для каждого Строка Из Таблица Цикл
		Строка.СтатусСМС = ОтправкаSMSЧерезАльфаSMS.СтатусДоставки(Строка.ИдентификаторСообщения,Логин,Пароль);
	КонецЦикла;

	

КонецПроцедуры // ОбновитьСтатусыНаСервере()


&НаКлиенте
Процедура Записать(Команда)
	
	ВыполнитьЗаписьНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьЗаписьНаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаТЧ.Период,
	               |	ТаблицаТЧ.ЛицевойСчет,
	               |	ТаблицаТЧ.НомерСотовогоТелефона КАК НомерТелефона,
	               |	ТаблицаТЧ.МесяцНачисления,
	               |	ТаблицаТЧ.СтатусСМС,
	               |	ТаблицаТЧ.ИдентификаторСообщения
	               |ПОМЕСТИТЬ ТаблицаТЧ
	               |ИЗ
	               |	&ТаблицаТЧ КАК ТаблицаТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РегистрУведомлений.Период,
	               |	РегистрУведомлений.МесяцНачисления,
	               |	РегистрУведомлений.ЛицевойСчет,
	               |	РегистрУведомлений.Операция,
	               |	ЕСТЬNULL(РегистрУведомлений.ИдентификаторСообщения, """") КАК ИдентификаторСообщения,
	               |	РегистрУведомлений.Количество,
	               |	ТаблицаТЧ.СтатусСМС КАК СтатусСМС
	               |ИЗ
	               |	ТаблицаТЧ КАК ТаблицаТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрУведомлений КАК РегистрУведомлений
	               |		ПО ТаблицаТЧ.ЛицевойСчет = РегистрУведомлений.ЛицевойСчет
	               |			И ТаблицаТЧ.ИдентификаторСообщения = РегистрУведомлений.ИдентификаторСообщения";
	Запрос.УстановитьПараметр("ТаблицаТЧ",Таблица.Выгрузить());	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не заполнен список сообщений';uk='Чи не заповнений список повідомлень'");
		Сообщение.Поле = "Таблица";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если СокрЛП(Выборка.ИдентификаторСообщения) =  "" Тогда
			Продолжить;                                     
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.РегистрУведомлений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Значение = Выборка.ИдентификаторСообщения;
		НаборЗаписей.Отбор.ИдентификаторСообщения.Использование = Истина;
		
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	
				   
		
КонецПроцедуры // ()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Здание") Тогда
		Объект.Здание = Параметры.Здание;
	КонецЕсли;
	
КонецПроцедуры
